validacao/results/dvwa/modsecurity/06_wrk.log
=== wrk | dvwa/modsecurity | https://172.18.0.5:8443 | 17/07/2026 20:45:59,52 ===
REPETICOES: 1
CMD: wrk -t12 -c400 -d30s --timeout 5s --latency -H "User-Agent: DoBotShield-TCC-Validation/1.0" https://172.18.0.5:8443
----------------------------------------------------------------

=== EXECUCAO UNICA ===
Running 30s test @ https://172.18.0.5:8443
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   253.20ms  102.09ms 780.03ms   68.73%
    Req/Sec   130.61     38.89   373.00     63.89%
  Latency Distribution
     50%  244.08ms
     75%  312.94ms
     90%  383.86ms
     99%  556.18ms
  46320 requests in 30.08s, 20.45MB read
Requests/sec:   1539.92
Transfer/sec:    696.27KB
RUN_RC=0

TOOL_RC=0